class Kenzou {
	
	public static void main(String[] args){
	
	}
	
	static void henkou(String array[][] , String header[]){
		header[0] = "建造レシピ";
		header[1] = "主な艦娘";
		header[2] = "必要な旗艦";
		header[3] = "燃料";
		header[4] = "弾薬";
		header[5] = "鋼材";
		header[6] = "ボーキ";
		header[7] = "資材";
		header[8] = "備考";

		String kenzouname[][] = {
			{"駆逐艦","最低レシピ","なし","30","30","30","30","1","駆逐艦全種・弥生・夕張などもでる"},
			{"","雪風・島風","なし","250","30","200","30","1","確率は島風２％、雪風は1.5％"},
			{"","Z1・Z3","Z1・Z3","250","30","200","30","1","Z1旗艦の場合はZ3が、Z3が機関の場合はZ3"},
			{"","上位２つの亜種","","250","130","200","30","1","確率はほんの少し低め"},
			
			{"軽巡洋艦","最低レシピ","なし","30","30","30","30","1","駆逐・軽巡がメインに出る(レアは夕張)"},
			{"","軽巡・重巡メイン","なし","250","30","200","30","1","通常駆逐をなるべく除いたレシピ"},
			
			{"重巡洋艦","最低レシピ","なし","250","30","200","30","1","軽巡やレア駆逐・潜水艦などもでる"},
			{"","重巡・戦艦メイン","なし","400","30","600","30","1","戦艦レシピだが、重巡もでてくる"},
			
			{"戦艦","最低レシピ","なし","400","30","600","30","1","戦艦・重巡・軽巡など (長門・陸奥も低確率で出現)"},
			
			{"空母","最低レシピ","なし","300","30","400","300","1","空母15％　軽空母47％"},
			{"","確率高めなレシピ","なし","300","300","600","600","1","空母19％　軽空母52％"},
			
			{"潜水艦","最低レシピ","なし","250","30","200","30","1","伊58・伊168・伊8のレシピ（出現率は低め)"},
			{"","やや確率UP","なし","250","130","200","30","1","確率がちょっとだけ上がったレシピ"},
			
			{"大型建造","--------------","-----","---","---","---","---","---","---------------------------"},
			{"軽巡・重巡","最低レシピ","なし","1500","1500","2000","1000","1","阿賀野・能代・矢矧・三隈・鈴谷・熊野など"},
			{"","","なし","1500","1500","2000","1000","20","戦艦もやや出てくるレシピ"},
			
			{"戦艦","大和狙いレシピ","なし","4000","6000","6000","3000","20","12% ~ 13%で出てくるレシピ"},
			{"","資材多め","なし","4000","6000","6000","3000","100","確率は資材２０より劣るか？"},
			{"","ビスマルク狙い","Z1・Z3","4000","6000","6000","2000","20","10%の確率ででてくる"},
			
			{"空母","大鳳狙い","なし","4000","2000","5000","7000","20","15 ~ 17%で出てくるレシピ"},
			{"","ボーキ少なめレシピ","なし","4000","2000","5000","5200","20","確率は減るが大鳳は出てくる"},
			
			{"潜水艦","まるゆ","なし","1000","1000","1000","1000","1","最低レシピかハズレとして出てくる模様"},
			{"","伊401","なし","3500","3500","4000","2000","20","今のところ確率の高いレシピ(２％)"},
			
			{"揚陸艦","あきつ丸","なし","3800","2500","5000","4200","20","5 ~ 9%のレシピ　まだ未検証に近い"},
			
			
		};
		
		// {燃料,弾薬,鋼材,ボーキ}
		// ID Number
		for (int i = 0; i < kenzouname.length; i++){
			for (int a = 0; a < header.length; a++){
				array[i][a] = kenzouname[i][a];
			}
		}
		
}}